# №2
# Даны  два  целых  числа:  D  (день)  и  M  (месяц),  определяющие  правильную  дату.
# Вывести знак Зодиака, соответствующий этой дате:
# «Водолей»  (20.1  – 18.2),
# «Рыбы»     (19.2  – 20.3),
# «Овен»     (21.3  – 19.4),
# «Телец»    (20.4  – 20.5),
# «Близнецы» (21.5  – 21.6),
# «Рак»      (22.6  – 22.7),
# «Лев»      (23.7  – 22.8),
# «Дева»     (23.8  – 22.9),
# «Весы»     (23.9  – 22.10),
# «Скорпион» (23.10 – 22.11),
# «Стрелец»  (23.11 – 21.12),
# «Козерог»  (22.12 – 19.1).
D, M = map(int, input().split())
if 1 <= M <= 2 and (20 <= D <= 31 or 1 <= D <= 18):
    print('Водолей')
elif 2 <= M <= 3 and (19 <= D <= 31 or 1 <= D <= 20):
    print('Рыбы')
elif 3 <= M <= 4 and (21 <= D <= 31 or 1 <= D <= 19):
    print('Овен')
elif 4 <= M <= 5 and (20 <= D <= 31 or 1 <= D <= 20):
    print('Телец')
elif 5 <= M <= 6 and (21 <= D <= 31 or 1 <= D <= 21):
    print('Близнецы')
elif 6 <= M <= 7 and (22 <= D <= 31 or 1 <= D <= 22):
    print('Рак')
elif 7 <= M <= 8 and (23 <= D <= 31 or 1 <= D <= 22):
    print('Лев')
elif 8 <= M <= 9 and (23 <= D <= 31 or 1 <= D <= 22):
    print('Дева')
elif 9 <= M <= 10 and (23 <= D <= 31 or 1 <= D <= 22):
    print('Весы')
elif 10 <= M <= 11 and (23 <= D <= 31 or 1 <= D <= 22):
    print('Скорпион')
elif 11 <= M <= 12 and (23 <= D <= 31 or 1 <= D <= 21):
    print('Стрелец')
elif (12 == M or M == 1) and (22 <= D <= 31 or 1 <= D <= 19):
    print('Козерог')